DEFINE_GRADIENT_PALETTE(Temperature1){
  0, 0, 0, 139,                //DarkBlue
  128 - 30 * 2, 0, 0, 255,     //Blue
  128 - 20 * 2, 30, 144, 255,  //DodgerBlue
  128 - 10 * 2, 0, 191, 255,   //DeepSkyBlue
  128 + 0, 176, 224, 230,      //PowderBlue
  128 + 10, 238, 232, 170,     //PaleGoldenrod
  128 + 20, 255, 215, 0,       //Gold
  128 + 30, 255, 165, 0,       //Orange
  255, 255, 0, 0               //Red
};
CRGBPalette256 myPalette1 = Temperature1;

DEFINE_GRADIENT_PALETTE(Temperature2){
  0, 0, 0, 139,                //DarkBlue
  128 - 30 * 2, 138, 43, 255,  //BlueViolet
  128 - 20 * 2, 30, 144, 255,  //DodgerBlue
  128 - 10 * 2, 0, 255, 255,   //Aqua
  128 + 0, 0, 250, 154,        //MediumSpringGreen
  128 + 10, 0, 255, 0,         //Lime
  128 + 20, 173, 255, 47,      //GreenYellow
  128 + 30, 255, 165, 0,       //Orange
  255, 255, 0, 0               //Red
};
CRGBPalette256 myPalette2 = Temperature2;

DEFINE_GRADIENT_PALETTE(Temperature3) {
  0, 0, 0, 139,                // DarkBlue
  128 - 30 * 2, 233, 150, 122, // Тёмно-синий
  128 - 25 * 2, 250, 128, 114  , // Синий
  128 - 20 * 2, 123, 104, 238, // MediumSlateBlue
  128 - 15 * 2, 0, 191, 255,   // Голубой +
  128 - 10 * 2, 128, 0, 128,   // Фиолетовый +
  128 - 5 * 2, 147, 112, 219,  // Средне - пурпурный +
  128 + 0, 25, 25, 112,        // MidnightBlue ++++++++++   ноль градусов  +++++++++++++++++
  128 + 5, 88, 214, 141,       // серо-зеленый +
  128 + 10, 241, 196, 15,      // Светлая охра+
  128 + 15, 241, 148, 138,     // Серо-вишнёвый +
  128 + 20, 165, 105, 189,     // Бледно-фиолетовый +
  128 + 25, 220, 20, 60,       // Малиновый
  128 + 30, 255, 36, 0,        // Алый
  255, 255, 0, 0               // Red
};
CRGBPalette256 myPalette3 = Temperature3;

DEFINE_GRADIENT_PALETTE(Temperature4) {
  0, 0, 0, 139,                // DarkBlue
  128 - 30 * 2, 138, 43, 255,  // BlueViolet
  128 - 25 * 2, 139, 0, 139,   // DarkMagenta
  128 - 20 * 2, 75, 0, 130,    // Индиго
  128 - 15 * 2, 147, 112, 219, // Средне - пурпурный +
  128 - 10 * 2, 123, 104, 238, // MediumSlateBlue
  128 - 5 * 2, 70, 130, 180,   // Стальной синий +
  128 + 0, 25, 25, 112,        // MidnightBlue ++++++++++  ноль градусов  +++++++++++++++++++++++++++++++
  128 + 5, 220, 20, 60,        // Crimson
  128 + 10, 255, 99, 71,       // Помидор +
  128 + 15, 127, 255, 0,       // Шартрез +
  128 + 20, 255, 165, 0,       // Оранжевый  +
  128 + 25, 215, 24, 104,      // Грузинский розовый
  128 + 30, 255, 0, 51,        // Карминово-красный
  255, 255, 0, 0               // Red
};
CRGBPalette256 myPalette4 = Temperature4;